I could reproduce the problem.

According to the document, `docker_image.name` supports an image digest, but actually doesn't work well.

https://registry.terraform.io/providers/kreuzwerker/docker/latest/docs/resources/image#name

> name - (Required, string) The name of the Docker image, including any tags or SHA256 repo digests.

```console
$ terraform version
Terraform v0.14.9
+ provider registry.terraform.io/kreuzwerker/docker v2.11.0
```

```tf
resource "docker_image" "nginx" {
  name = "nginx:1.18.0@sha256:0c56c40f232f41c1b8341c3cc055c8b528cb6decefd7f7c8506e2d30bb9678b6"
}

terraform {
  required_providers {
    docker = {
      source  = "kreuzwerker/docker"
      version = "2.11.0"
    }
  }
}

provider "docker" {
}
```

We can pull the Docker image by `docker pull` command, but `terraform apply` failed.

```console
$ terraform apply                                                                                          

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # docker_image.nginx will be created
  + resource "docker_image" "nginx" {
      + id     = (known after apply)
      + latest = (known after apply)
      + name   = "nginx:1.18.0@sha256:0c56c40f232f41c1b8341c3cc055c8b528cb6decefd7f7c8506e2d30bb9678b6"
      + output = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

docker_image.nginx: Creating...

Error: Unable to read Docker image into resource: Unable to find or pull image nginx:1.18.0@sha256:0c56c40f232f41c1b8341c3cc055c8b528cb6decefd7f7c8506e2d30bb9678b6

  on main.tf line 1, in resource "docker_image" "nginx":
   1: resource "docker_image" "nginx" {

$ docker pull "nginx:1.18.0@sha256:0c56c40f232f41c1b8341c3cc055c8b528cb6decefd7f7c8506e2d30bb9678b6"
docker.io/library/nginx@sha256:0c56c40f232f41c1b8341c3cc055c8b528cb6decefd7f7c8506e2d30bb9678b6: Pulling from library/nginx
e95f33c60a64: Pull complete 
8b052b3c1a10: Pull complete 
a4f5d275d76e: Pull complete 
926c236b9574: Pull complete 
f049360d30a6: Pull complete 
Digest: sha256:0c56c40f232f41c1b8341c3cc055c8b528cb6decefd7f7c8506e2d30bb9678b6
Status: Downloaded newer image for nginx@sha256:0c56c40f232f41c1b8341c3cc055c8b528cb6decefd7f7c8506e2d30bb9678b6
docker.io/library/nginx:1.18.0@sha256:0c56c40f232f41c1b8341c3cc055c8b528cb6decefd7f7c8506e2d30bb9678b6
```